Revit 2026 API

# ElementIsValidType(Document, ICollectionElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidType(
	Document document,
	ICollection<ElementId> elementIds,
	ElementId typeId
)
```
```vb
Public Shared Function IsValidType (
	document As Document,
	elementIds As ICollection(Of ElementId),
	typeId As ElementId
) As Boolean
```
```cpp
public:
static bool IsValidType(
	Document^ document,
	ICollection<ElementId^>^ elementIds,
	ElementId^ typeId
)
```
```fsharp
static member IsValidType :
        document : Document *
        elementIds : ICollection<ElementId> *
        typeId : ElementId -> bool
```

#### Parameters

document Document

elementIds ICollectionElementId

typeId ElementId

#### Return Value

Boolean

#### Reference

Element Class

IsValidType Overload

Autodesk.Revit.DB Namespace